{
  "blogs": [
    {
      "id": "systemic-oppression-minorities-india",
      "title": "Systemic Oppression of Minorities in India and Its Ripple Effects on Bangladesh",
      "author": "S. M. Riazul Islam",
      "date": "13/01/2025",
      "preview": "India has long relied on the cooperative relationship fostered by Sheikh Hasina and the Awami League in Bangladesh, prioritizing political alliances at the party level over fostering genuine connections with the broader Bangladeshi populace. However, after being ousted from power and fleeing to India, Sheikh Hasina is grappling with mounting challenges and a complex political transition....",
      "content": "India has long relied on the cooperative relationship fostered by Sheikh Hasina and the Awami League in Bangladesh, prioritizing political alliances at the party level over fostering genuine connections with the broader Bangladeshi populace. However, after being ousted from power and fleeing to India, Sheikh Hasina is grappling with mounting challenges and a complex political transition. This situation has significant implications for the relationship between India and Bangladesh, particularly in terms of minority rights and regional stability. The systemic oppression of minorities in India has created ripple effects that extend beyond its borders, affecting neighboring countries like Bangladesh in various ways. This article explores these dynamics and their broader implications for regional relations and minority rights."
    },
    {
      "id": "bangladesh-21st-century",
      "title": "BANGLADESH IN 21st CENTURY: A call for an all-inclusive national revival",
      "author": "Dr M Abdul Bari",
      "date": "17/10/2023",
      "preview": "Bangladesh, a historical land of over 170 million people compacted into a small landmass, was paralysed by 190 years of British colonial humiliation. Sadly, after a brief period of post-colonial Pakistani political-economic domination, the country has entered a new phase of Indian intellectual-cultural domination. While the country has recently made good economic progress, its otherwise resilient population is experiencing despondency due to its deeply divided politics and a litany of corruption and moral breakdown. It is now time for Bangladeshis to stand on their own feet with an all-round intellectual, cultural, moral and spiritual revival or 'Renaissance'. The country desperately needs leaders of positive change from all sectors of life to restore its dignified position in the global community.",
      "content": "Bangladesh, a historical land of over 170 million people compacted into a small landmass, was paralysed by 190 years of British colonial humiliation. Sadly, after a brief period of post-colonial Pakistani political-economic domination, the country has entered a new phase of Indian intellectual-cultural domination. While the country has recently made good economic progress, its otherwise resilient population is experiencing despondency due to its deeply divided politics and a litany of corruption and moral breakdown. It is now time for Bangladeshis to stand on their own feet with an all-round intellectual, cultural, moral and spiritual revival or 'Renaissance'. The country desperately needs leaders of positive change from all sectors of life to restore its dignified position in the global community. This comprehensive analysis explores the historical context, current challenges, and potential pathways for national revival in Bangladesh."
    },
    {
      "id": "erdogan-banking-logic",
      "title": "Has Erdogan's dis-interest in traditional banking logic gone bust?",
      "author": "TFI Desk",
      "date": "08/01/2022",
      "preview": "Coronavirus shutdowns around the world pushed countries into crisis mode. Amid the death and destruction of lives, jobs and business, governments to tackle these issues cut down traditional economic thought with an unprecedented rescue spend . This effort to soften the blow from what's expected to be the worst economic freefall since the great depression has already seen over $10 trillion injected into nations across the globe, leaving economists scratching their heads, attempting to predict the unpredictable...",
      "content": "Coronavirus shutdowns around the world pushed countries into crisis mode. Amid the death and destruction of lives, jobs and business, governments to tackle these issues cut down traditional economic thought with an unprecedented rescue spend. This effort to soften the blow from what's expected to be the worst economic freefall since the great depression has already seen over $10 trillion injected into nations across the globe, leaving economists scratching their heads, attempting to predict the unpredictable. President Erdogan's unconventional approach to monetary policy has been particularly noteworthy, challenging traditional banking logic and raising questions about the sustainability of such policies in the long term. This article examines the implications of these economic strategies and their potential impact on Turkey's financial future."
    }
  ]
}
